
///////////////////////////////////////////////////
//Служебные функции и процедуры
///////////////////////////////////////////////////

&НаКлиенте
// контекст фреймворка Vanessa-Behavior
Перем Ванесса;
 
&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Behavior.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,ОписаниеШага,ТипШага,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"УМеняЕстьФизлицоСКодом(Парам01)","УМеняЕстьФизлицоСКодом","Допустим У меня есть Физлицо с кодом ""000000001""","","");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ДатаРожденияРавна(Парам01)","ДатаРожденияРавна","И Дата рождения равна '19671010'","","");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ДатаДокументаРавна(Парам01)","ДатаДокументаРавна","И Дата документа равна '20170331'","","");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВозрастФизлицаВМесяцахДолженБытьРавен(Парам01)","ВозрастФизлицаВМесяцахДолженБытьРавен","Тогда Возраст физлица в месяцах должен быть равен 593","","");

	Возврат ВсеТесты;
КонецФункции
	
&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции



///////////////////////////////////////////////////
//Работа со сценариями
///////////////////////////////////////////////////

&НаКлиенте
// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры



///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

&НаКлиенте
//Допустим У меня есть Физлицо с кодом "000000001"
//@УМеняЕстьФизлицоСКодом(Парам01)
Процедура УМеняЕстьФизлицоСКодом(Парам01) Экспорт
	Контекст.Вставить("Физлицо",Парам01);
КонецПроцедуры

&НаКлиенте
//И Дата рождения равна '19671010'
//@ДатаРожденияРавна(Парам01)
Процедура ДатаРожденияРавна(Парам01) Экспорт
	Контекст.Вставить("ДатаРождения",Парам01);
КонецПроцедуры

&НаКлиенте
//И Дата документа равна '20170331'
//@ДатаДокументаРавна(Парам01)
Процедура ДатаДокументаРавна(Парам01) Экспорт
	Контекст.Вставить("ДатаДокумента",Парам01);
КонецПроцедуры

&НаКлиенте
//Тогда Возраст физлица в месяцах должен быть равен 593
//@ВозрастФизлицаВМесяцахДолженБытьРавен(Парам01)
Процедура ВозрастФизлицаВМесяцахДолженБытьРавен(Парам01) Экспорт
	ВозрастЧеловекаВМесяцах = ОбщийМодуль1.ПолучитьВозрастФизлицаВМесяцах(Контекст);
	Если Не ВозрастЧеловекаВМесяцах = 593 Тогда
		ВызватьИсключение "Результат расчета не верен.";
	КонецЕсли;	
КонецПроцедуры
